Revit 2024 API
ElectricalSetting.GetCircuitNamingSchemeSettings Method
 Gets the circuit naming scheme settings of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static CircuitNamingSchemeSettings GetCircuitNamingSchemeSettings(
	Document cda
)
Visual Basic
Public Shared Function GetCircuitNamingSchemeSettings ( _
	cda As Document _
) As CircuitNamingSchemeSettings
Visual C++
public:
static CircuitNamingSchemeSettings^ GetCircuitNamingSchemeSettings(
	Document^ cda
)
Parameters
cda
Type: Autodesk.Revit.DB.Document
 The document.
Return Value
 The circuit naming scheme settings of the project.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace